from typing import Dict

DEFAULT_HOLIDAYS: Dict[str, str] = {
    "2026-01-01": "元旦",
    "2026-01-02": "元旦",
    "2026-01-03": "元旦",
    "2026-02-15": "春节",
    "2026-02-16": "春节",
    "2026-02-17": "春节",
    "2026-02-18": "春节",
    "2026-02-19": "春节",
    "2026-02-20": "春节",
    "2026-02-21": "春节",
    "2026-02-22": "春节",
    "2026-02-23": "春节",
    "2026-04-04": "清明节",
    "2026-04-05": "清明节",
    "2026-04-06": "清明节",
    "2026-05-01": "劳动节",
    "2026-05-02": "劳动节",
    "2026-05-03": "劳动节",
    "2026-05-04": "劳动节",
    "2026-05-05": "劳动节",
    "2026-06-19": "端午节",
    "2026-06-20": "端午节",
    "2026-06-21": "端午节",
    "2026-09-25": "中秋节",
    "2026-10-01": "国庆节",
    "2026-10-02": "国庆节",
    "2026-10-03": "国庆节",
    "2026-10-04": "国庆节",
    "2026-10-05": "国庆节",
    "2026-10-06": "国庆节",
    "2026-10-07": "国庆节"
}

DEFAULT_FORCE_WORKDAYS = "0104,0214,0228,0509,0920,1010"
DOMAIN = "hol_asst"
LOGGER_NAME = f"{DOMAIN}_logger"

CONF_USERNAME = "username"
CONF_HOLIDAYS = "holidays"
CONF_FORCE_WORKDAYS = "force_workdays"
CONF_CUSTOM_REST_DAYS = "rest_days"
CONF_TIMEZONE = "timezone"

PLATFORMS = ["sensor"] 


SENSOR_NAME_TODAY = "日期"
SENSOR_NAME_HOLIDAY = "是否为休息日"

STATE_HOLIDAY = "休息日"
STATE_WORKDAY = "工作日"
